import React from "react";
import "./QuestionAndAns.css";

const QuestionAndAns = () => {
  return (
    <div className="QuestionAndAns">
      <h3>1. how react works?</h3>
      <p>
        React জাভাস্ক্রিপ্টের জনপ্রিয় ফ্রেমওয়ার্ক। React এর কম্পোনেন্ট মিলে
        একটি ব্লক তৈরী করে যা অ্যাপ্লিকেশনের বিভিন্ন অংশে ব্যবহৃত হয়। React এর
        লজিক অনুযায়ী কম্পোনেন্টকে নিজের মতো পরিবর্তন করে নেয়। React একমুখী
        ডেটা প্রবাহ করে থাকে। যখন একটি রিয়েক্ট অ্যাপ ডিজাইন করা হয়, তখন
        প্যারেন্ট ও চাইল্ড কম্পোনেন্টের মধ্যে props দ্বারা কানেকশন তৈরী করা হয়।
        এতে করে সহজে data প্যারেন্ট থেকে চাইল্ড কম্পোনেন্টে পাঠান যায়। ও কোনো
        বাগ পাওয়া গেলে সেটা দ্রুত ফিক্স করা যায়।
      </p>
      <h3> 2. how useState works?</h3>
      <p>
        useState হল একটি Hook। React.useState ২টি value রিটার্ন করে এবং এই value
        ২টি একটি array টাইপে রিটার্ন হয়ে আসে যেটার ভিতরে ২টি এলেমেন্ট থাকে।
        আমরা useState() ফাংশনে initial state পাস করি এবং এটি current state মান
        সহ একটি ভেরিয়েবল প্রদান করে যা প্রথম এলিমেন্ট এবং এই মানটি আপডেট করার
        জন্য অন্য একটি ফাংশন দেয় যা দ্বিতীয় এলিমেন্ট।
      </p>
    </div>
  );
};

export default QuestionAndAns;
