import React from "react";
import "./QuestionAndAns.css";

const QuestionAndAns = () => {
  return (
    <div className="QuestionAndAns">
      <h3>1. how react works?</h3>
      <p>
        React জাভাস্ক্রিপ্টের জনপ্রিয় ফ্রেমওয়ার্ক। React এর কম্পোনেন্ট মিলে
        একটি ব্লক তৈরী করে যা অ্যাপ্লিকেশনের বিভিন্ন অংশে ব্যবহৃত হয়। React এর
        লজিক অনুযায়ী কম্পোনেন্টকে নিজের মতো পরিবর্তন করে নেয়। React একমুখী
        ডেটা প্রবাহ করে থাকে। যখন একটি রিয়েক্ট অ্যাপ ডিজাইন করা হয়, তখন
        প্যারেন্ট ও চাইল্ড কম্পোনেন্টের মধ্যে props দ্বারা কানেকশন তৈরী করা হয়।
        এতে করে সহজে data প্যারেন্ট থেকে চাইল্ড কম্পোনেন্টে পাঠান যায়। ও কোনো
        বাগ পাওয়া গেলে সেটা দ্রুত ফিক্স করা যায়।
      </p>
      <h3>2.Difference between State and Props?</h3>
      <p>
        props এবং state এর মধ্যে মূল পার্থক্য হল যে state internal এবং
        কম্পোনেন্টের দ্বারাই নিয়ন্ত্রিত হয় যেখানে props external এবং
        কম্পোনেন্টের রেন্ডার দ্বারা নিয়ন্ত্রিত হয়।
      </p>
      <p>
        State একটি আপডেটযোগ্য structure যা data ধারণ করতে ব্যবহৃত হয় এবং সময়ের
        সাথে পরিবর্তন হতে পারে। State পরিবর্তন ব্যবহারকারীর response বা সিস্টেম
        ইভেন্টের পরিবর্তন হিসাবে ঘটতে পারে।
      </p>
      <p>
        Props হল read-only components। এটি এমন একটি অবজেক্ট যা ট্যাগের attribute
        এর মান store করে এবং HTML attribute এর মতো কাজ করে। এটি একটি উপাদান থেকে
        অন্য উপাদানে ডেটা পাস করতে দেয়।
      </p>
    </div>
  );
};

export default QuestionAndAns;
